export type serviceFeatureType = {
  title: string;
  image: string;
  url: string;
};

export const serviceFeatures: serviceFeatureType[] = [
  {
    title: "اﻣﮑﺎن ﺗﺤﻮﯾﻞ اﮐﺴﭙﺮس",
    url: "/",
    image:
      "https://www.digikala.com/statics/img/svg/footer/express-delivery.svg",
  },
  {
    title: "امکان پرداخت در محل",
    url: "/",
    image:
      "https://www.digikala.com/statics/img/svg/footer/cash-on-delivery.svg",
  },
  {
    title: "۷ روز ﻫﻔﺘﻪ، ۲۴ ﺳﺎﻋﺘﻪ",
    url: "/",
    image: "https://www.digikala.com/statics/img/svg/footer/support.svg",
  },
  {
    title: "هفت روز ضمانت بازگشت کالا",
    url: "/",
    image: "https://www.digikala.com/statics/img/svg/footer/days-return.svg",
  },
  {
    title: "ﺿﻤﺎﻧﺖ اﺻﻞ ﺑﻮدن ﮐﺎﻟﺎ",
    url: "/",
    image:
      "https://www.digikala.com/statics/img/svg/footer/original-products.svg",
  },
];

type link = {
  name: string;
  url: string;
};

export type footerLinkType = {
  title: string;
  links: link[];
};

export const footerLinks: footerLinkType[] = [
  {
    title: "با دیجی‌کالا",
    links: [
      { name: "اتاق خبر دیجی‌کالا", url: "/" },
      { name: "فروش در دیجی‌کالا", url: "/" },
      { name: "فرصت‌های شغلی", url: "/" },
      { name: "گزارش تخلف در دیجی‌کالا", url: "/" },
      { name: "تماس با دیجی‌کالا", url: "/" },
      { name: "درباره دیجی‌کالا", url: "/" },
    ],
  },
  {
    title: "خدمات مشتریان",
    links: [
      { name: "پاسخ به پرسش‌های متداول", url: "/" },
      { name: "رویه‌های بازگرداندن کالا", url: "/" },
      { name: "شرایط استفاده", url: "/" },
      { name: "حریم خصوصی", url: "/" },
      { name: "گزارش باگ", url: "/" },
      { name: "", url: "/" },
    ],
  },
  {
    title: "راهنمای خرید از دیجی‌کالا",
    links: [
      { name: "نحوه ثبت سفارش", url: "/" },
      { name: "رویه ارسال سفارش", url: "/" },
      { name: "شیوه‌های پرداخت", url: "/" },
    ],
  },
];

export type aboutUsType = {
  title: string;
  description: string;
};

export const aboutUs: aboutUsType[] = [
  {
    title: "ویژگی های مهم دیجی کالا",
    description:
      "یکی از ویژگی‌های مهم در خرید از دیجی کالا، تنوع بی‌نظیر محصولات است. این فروشگاه اینترنتی طیف وسیعی از کالاها را در دسته‌های مختلف از جمله لوازم دیجیتال، لوازم خانگی، مد و پوشاک، لوازم آرایشی و بهداشتی، محصولات سلامت و زیبایی، و بسیاری از محصولات دیگر ارائه می‌دهد. به عنوان مثال، اگر به دنبال خرید یک گوشی موبایل جدید باشید، دیجی کالا مجموعه‌ای از بهترین گوشی‌ها از برندهای معتبر اپل و سامسونگ مانند ایفون 16، گوشی S25، گوشی‌های مختلف از برند شیائومی مانند شیائومی نوت ۱۴ و بسیاری از برندهای دیگر را در اختیار شما قرار می‌دهد. همچنین برای علاقه‌مندان به لوازم دیجیتال، این فروشگاه اینترنتی انواع لپ تاپ، تلویزیون، اسپیکر، و هندزفری بلوتوثی با کیفیت بالا را برای خرید آنلاین ارائه می‌دهد. دیجی کالا، مقصدی بی‌پایان برای خرید آسان، سریع و مطمئن است. راهی که هر آنچه نیاز دارید از قیمت لپ تاپ تا یک ایرپاد مطمئن را در اختیار شما قرار می‌دهد.",
  },
  {
    title: "ارسال سریع و مطمئن کالا",
    description:
      "یکی از مهم‌ترین دغدغه‌های کاربران خرید آنلاین، زمان تحویل کالا است. دیجی کالا برای حل این مشکل، گزینه‌های مختلف ارسال را در نظر گرفته است تا کاربران بتوانند بر اساس نیاز خود، روش ارسال مناسب را انتخاب کنند. به عنوان مثال، ارسال کالا به صورت ارسال امروز، ارسال سریع توسط پیک‌های دیجی کالا، از جمله روش‌های خرید سریع از این فروشگاه اینترنتی است. این امکانات باعث می‌شود که خریداران بتوانند سفارش خود را در کوتاه‌ترین زمان ممکن دریافت کنند. علاوه بر این، در صورتی که کالای خریداری شده از لحاظ کیفیت یا هر دلیل دیگری رضایت مشتری را جلب نکرده باشد، دیجی کالا ضمانت بازگشت کالا را ارائه می‌دهد. این ویژگی موجب اعتماد بیشتر مشتریان به خرید آنلاین از فروشگاه اینترنتی دیجی کالا شده است.",
  },
  {
    title: "تخفیف های ویژه و جشنواره ها",
    description:
      "دیجی کالا به طور منظم جشنواره‌ها و تخفیف‌های ویژه‌ای را برگزار می‌کند که برای مشتریان فرصت خرید کالاهای باکیفیت با قیمت‌های مناسب به همراه خواهد داشت. این تخفیف‌ها در ایام خاص مانند بلک فرایدی یا همان حراج جمعه سیاه و جشنواره‌های تابستانی توجه بسیاری از خریداران را جلب می‌کند. در این جشنواره‌ها، دیجی کالا تخفیف‌های عالی روی محصولات مختلف از جمله گوشی‌های موبایل، لپ تاپ‌ها، تلویزیون‌ها، و حتی محصولات زیبایی ارائه می‌دهد. می‌توانید گوشی ایفون 16 یا گوشی S25 را با تخفیف‌های ویژه خریداری کنید و از قیمت مناسب بهره‌مند شوید. دیجی کالا فراتر از یک فروشگاه اینترنتی، یک تجربه خرید مطمئن در بین کاربران مختلف بوده است که با ارائه بزرگ‌ترین تنوع کالا، قیمت‌های مختلف و خدماتی بی‌نقص، به مقصد اول خریداران آنلاین در ایران تبدیل شده است.",
  },
  {
    title: "انواع محصولات فروشگاه دیجی کالا",
    description:
      "دیجی کالا دارای محصولات متنوعی در گروه‌های مختلف است که خرید آنها بسیار راحت و سریع است. به عنوان مثال، اگر به دنبال قاب گوشی یا هندزفری بلوتوثی باشید، می‌توانید مدل‌های مختلف و برندهای گوناگونی را در این فروشگاه پیدا کنید.",
  },
  {
    title: "موبایل و کالای دیجیتال",
    description:
      "دیجی‌کالا انواع گوشی‌های هوشمند از برندهای معتبر جهانی مانند سامسونگ، اپل، شیائومی و هواوی را با مشخصات و قیمت‌های متنوع عرضه می‌کند. علاوه بر موبایل، دیجی‌کالا مجموعه‌ای از لوازم جانبی مانند هدفون، هندزفری، ساعت‌های هوشمند، تبلت‌ها و لپ تاپ را نیز در اختیار مشتریان قرار می‌دهد. با امکان مقایسه محصولات، مطالعه نظرات کاربران و دسترسی به جدیدترین مدل‌ها، دیجی‌کالا به یکی از مقاصد اصلی خرید آنلاین در حوزه موبایل و کالای دیجیتال تبدیل شده است. از دهه گذشته همواره دیجی کالا به عنوان اولین گزینه برای خرید گوشی های سامسونگ، آیفون های اپل و گوشی شیائومی محسوب می‌شده است و تا امروز هم در عرضه این موبایل های محبوب به بازار، دیجی‌کالا اولین فروشگاه آنلاین بوده است.",
  },
  {
    title: "کتاب و لوازم تحریر",
    description:
      "کتاب، لوازم تحریر و هنر در دیجی کالا یک مجموعه بی‌نظیر از محصولات فرهنگی و هنری است که به علاقه‌مندان به کتابخوانی، هنر و نوشتن کمک می‌کند تا دنیای خود را گسترش دهند. از کتاب‌های چاپی و کتاب‌های صوتی گرفته تا مجلات خارجی و داخلی و آثار معروف‌ترین نویسندگان مثل سعدی، حافظ، مولانا و فروغ فرخزاد، تمامی نیازهای کتابخوان‌ها را پوشش می‌دهد. همچنین با مجموعه‌ای از لوازم تحریر، ابزار نقاشی و رنگ‌آمیزی، آلبوم‌های عکس و فرش‌های دستبافت، به شما این امکان را می‌دهد تا دنیای هنر و خلاقیت خود را به بهترین نحو پرورش دهید.",
  },
  {
    title: "لوازم آرایشی و بهداشتی",
    description:
      "در دسته محصولات آرایشی و بهداشتی، دیجی کالا مجموعه‌ای از بهترین و پرطرفدارترین برندهای جهانی را در اختیار کاربران قرار می‌دهد. محصولات متنوعی همچون مرطوب كننده‌ها، كرم پودر، ضدآفتاب، ريمل و رژلب از برندهایی مانند لورال، کلینیک و میبلین در دیجی کالا موجود هستند که برای هر سلیقه و نیاز قابل انتخاب هستند. علاوه بر این، شما می‌توانید محصولات مراقبت از پوست و مو مانند شامپو، کرم‌های ضد چروک و ماسک صورت را در این فروشگاه بیابید و خرید آنلاین خود را به راحتی انجام دهید. دیجی کالا، بزرگ‌ترین و معتبرترین فروشگاه آنلاین لوازم آرایشی ایران، جایی که تنوع، کیفیت و اطمینان در خرید یکجا جمع شده‌اند.",
  },
  {
    title: "خرید آنلاین طلا و جواهرات",
    description:
      "دیجی کالا به عنوان بزرگترین فروشگاه اینترنتی ایران، یکی از بهترین گزینه‌ها برای خرید طلا و جواهرات آنلاین است. شما می‌توانید خريد گردنبند طلا، انگشتر طلا، گوشواره زنانه طلا و دستبند طلا را با بهترین قیمت‌ها از دیجی کالا انجام دهید. این فروشگاه مجموعه‌ای از بهترین برندهای طلا و جواهرات را در اختیار مشتریان قرار داده است که انتخاب خرید را برای آنها بسیار آسان می‌کند. همچنین می‌توانید خريد سكه، و حتی ربع سكه را نیز از این فروشگاه با راحت‌ترین روش انجام دهید. ",
  },
  {
    title: "اسباب بازی",
    description:
      "این قسمت شامل تمامی نیازهای ضروری برای مراقبت، بهداشت، سرگرمی و راحتی کودک از بدو تولد تا دوران کودکی است. از لوازم بهداشت و حمام کودک و نوزاد مانند پوشک، دستمال مرطوب، شامپو کودک، حوله و وان حمام نوزاد گرفته تا محصولات ویژه‌ای مثل مینی واش و شامپو کودک و نوزاد، همه در این مجموعه موجود هستند. همچنین برای راحتی بیشتر، انواع پوشاک و کفش کودک و نوزاد از لباس نوزادی تا کفش پسرانه، کوله پشتی پسرانه، لباس دخترانه و کفش دخترانه به صورت آنلاین در دسترس شما قرار دارند.",
  },
];

export type digiBrandtype = {
  url: string;
  image: string;
};

export const digiBrandsFirst: digiBrandtype[] = [
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digimag.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digipay.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digistyle.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digiplus.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digiclub.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/jet.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digiMehr.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/diginext.svg",
    url: "/",
  },
];

export const digiBrandsSecond: digiBrandtype[] = [
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digiexpress.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/ganjeh.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/digify.svg",
    url: "/",
  },
  {
    image: "https://www.digikala.com/statics/img/svg/footer/smartech.svg",
    url: "/",
  },
  {
    image:
      "https://www.digikala.com/statics/img/svg/footer/digikala-business.svg",
    url: "/",
  },
  {
    image:
      "https://www.digikala.com/statics/img/svg/footer/digikala-service.svg",
    url: "/",
  },
];
