import {
  Armchair,
  CarFront,
  HeartPulse,
  Laptop,
  LucideProps,
  Refrigerator,
  Smartphone,
  Wrench,
} from "lucide-react";
import { ForwardRefExoticComponent, RefAttributes } from "react";

export type CategoryItemType = {
  id: number;
  title: string;
  icon: ForwardRefExoticComponent<
    Omit<LucideProps, "ref"> & RefAttributes<SVGSVGElement>
  >;
};

export const categories: CategoryItemType[] = [
  { id: 1, title: "موبایل", icon: Smartphone },
  { id: 2, title: "کالای دیجیتال", icon: Laptop },
  { id: 3, title: "خانه و آشپزخانه", icon: Armchair },
  { id: 4, title: "آرایشی و بهداشتی", icon: HeartPulse },
  { id: 5, title: "خودرو و موتور سیکلت", icon: CarFront },
  { id: 6, title: "لوازم خانگی و برقی", icon: Refrigerator },
  { id: 7, title: "ابزار آلات و تجهیزات", icon: Wrench },
];

export type CategoryColumnType = {
  title: string;
  items: string[];
};

export type CategoryItems = {
  [key: number]: {
    column1?: CategoryColumnType[];
    column2?: CategoryColumnType[];
    column3?: CategoryColumnType[];
    column4?: CategoryColumnType[];
  };
};

export const categoryItems: CategoryItems = {
  1: {
    column1: [
      {
        title: "برند‌های مختلف گوشی موبایل",
        items: [
          "گوشی آیفون",
          "گوشی سامسونگ",
          "گوشی شیائومی",
          "گوشی نوکیا",
          "گوشی آنر",
          "گوشی ریلمی",
          "گوشی موتورولا",
          "گوشی تی سی ال",
          "گوشی هواوری",
          "گوشی داریا",
          "گوشی گوگل پیکسل",
          "گوشی اوپو",
          "گوشی جی ال ایکس",
          "گوشی وکال",
          "گوشی وان پلاس",
          "گوشی بلک ویو",
          "قیمت گوشی",
        ],
      },
      {
        title: "برند‌های برتر",
        items: ["سامسونگ", "اپل", "هواوی", "آنر", "ریلمی"],
      },
    ],
    column2: [
      {
        title: "گوشی براساس قیمت",
        items: [
          "گوشی ارزان",
          "گوشی موبایل قسطی",
          "گوشی تا 2 میلیون تومان",
          "گوشی تا 5 میلیون تومان",
          "گوشی تا 7 میلیون تومان",
          "گوشی تا 15 میلیون تومان",
          "گوشی بالای 15 میلیون تومان",
        ],
      },
      {
        title: "گوشی براساس عملکرد",
        items: [
          "گوشی گیمینگ",
          "گوشی 5G",
          "گوشی دکمه‌ای",
          "گوشی ضد آب",
          "گوشی مناسب عکاسی",
          "گوشی میان‌رده",
          "گوشی پرچمدار",
          "گوشی دو سیمکارت",
        ],
      },
      {
        title: "گوشی براساس حافظه",
        items: [
          "گوشی 64 گیگابایت",
          "گوشی 128 گیگابایت",
          "گوشی 256 گیگابایت",
          "گوشی 512 گیگابایت",
          "گوشی یک ترابایت",
        ],
      },
      {
        title: "رزولوشن عکس",
        items: [
          "گوشی با دوربین 48 مگاپیکسل",
          "گوشی با دوربین 50 مگاپیکسل",
          "گوشی با دوربین 64 مگاپیکسل",
          "گوشی با دوربین 108 مگاپیکسل",
        ],
      },
    ],
    column3: [
      {
        title: "لوازم جانبی موبایل",
        items: [
          "شارژ گوشی",
          "شارژ وایرلس",
          "قاب و کاور گوشی",
          "گلس گوشی",
          "هولدر گوشی موبایل",
          "کابل شارژ و مبدل",
          "پاوربانک(شارژر همراه)",
        ],
      },
      {
        title: "تبلت",
        items: [
          "تبلت سامسونگ",
          "تبلت اپل(آی‌پد)",
          "تبلت شیائومی",
          "تبلت لنوو",
          "تبلت مایکروسافت",
          "تبلت دانش‌آموزی",
        ],
      },
      {
        title: "ساعت و مچ بند هوشمند",
        items: ["ساعت هوشمند سامسونگ", "ساعت هوشمند شیائومی", "اپل واچ"],
      },
    ],
    column4: [
      {
        title: "داغ ترین‌ها",
        items: [
          "گوشی S25 سامسونگ",
          "آیفون 16",
          "آیفون 16 پرومکس",
          "شارژر فندکی",
          "هولدر گردنی",
          "آیفون 13",
          "آیفون 12",
          "آیفون 11",
          "گوشی سامسونگ سری s",
          "گوشی سامسونگ سری a",
          "گوشی سامسونگ سری m",
          "کاور ایرپاد",
          "داریا باد 5G",
          "موتورولا moto E13",
          "پوکو M5s",
          "گلکسی S23 FE",
          "ردمی نوت 12",
          "گلکسی A14",
          "گلکسی A24",
          "گلکسی A34",
          "گلکسی A54",
          "قاب گوشی سامسونگ",
          "قاب گوشی آیفون",
          "قاب گوشی شیائومی",
          "قاب گوشی ریلمی",
          "قاب گوشی وکال",
        ],
      },
    ],
  },
  2: {
    column1: [
      {
        title: "لپ‌تاپ",
        items: [
          "لپ‌تاپ ایسوس",
          "لپ‌تاپ لنوو",
          "مک‌بوک",
          "لپ‌تاپ HP",
          "لپ‌تاپ دل",
          "لپ‌تاپ ایسر",
          "لپ‌تاپ ام اس آی",
          "لپ‌تاپ ROG",
          "لپ‌تاپ TUF Gaming",
          "لپ‌تاپ LOQ",
          "لپ‌تاپ Ideapad slim 3",
          "لپ‌تاپ Vivobook",
          "لپ‌تاپ Victus",
          "لپ‌تاپ کاستوم",
          "لپ‌تاپ استوک",
        ],
      },
    ],
    column2: [
      {
        title: "هدفون",
        items: [
          "هدفون بی‌سیم",
          "هدفون اپل(ایرپاد)",
          "هدفون بیتس",
          "هدفون سونی",
          "هدفون سامسونگ",
          "هدفون شیائومی",
          "هدفون جی بی ال",
          "هدفون ریزر",
        ],
      },
      {
        title: "هدست",
        items: [],
      },
      {
        title: "ساعت و مچ بند هوشمند",
        items: [
          "ساعت هوشمند سامسونگ",
          "ساعت هوشمند شیائومی",
          "اپل واچ",
          "بند اپل واچ",
          "بند ساعت هوشمند",
          "لوازم جانبی ساعت هوشمند",
        ],
      },
    ],
    column3: [
      {
        title: "پرینتر",
        items: [
          "پرینتر سه‌بعدی",
          "پرینتر حرارتی",
          "پرینتر رنگی",
          "پرینتر لیبل زن",
          "پرینتر اچ‌پی",
        ],
      },
      {
        title: "ماشین‌های اداری",
        items: [
          "کابل پرینتر",
          "کارتریج",
          "اسکنر",
          "تلفن",
          "بارکدخوان",
          "ویدئووال",
          "ویدئو پروژکتور",
          "دستگاه حضور و غیاب",
        ],
      },
    ],
    column4: [
      {
        title: "تبلت",
        items: [],
      },
      {
        title: "ایپد",
        items: ["ایپد ایر", "ایپد پرو"],
      },
      {
        title: "خانه هوشمند",
        items: [],
      },
      {
        title: "برند‌های برتر",
        items: [
          "شیائومی",
          "سامسونگ",
          "اپل",
          "هواوی",
          "آنر",
          "ریلمی",
          "توشیبا",
          "تکنو",
          "ایرانسل",
          "مبین‌نت",
        ],
      },
    ],
  },
};
